Tekla Open API Reference for Tekla Structures 2025
BaseWeld.Preparation Property
 Gets or sets the weld preparation.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld.WeldPreparationTypeEnum Preparation { get; set; }
Public Property Preparation As BaseWeld.WeldPreparationTypeEnum
	Get
	Set
Property Value
Type: BaseWeld.WeldPreparationTypeEnum
Exceptions
Exception | Condition
ArgumentException | Thrown when provided value is not defined in the WeldPreparationTypeEnum.
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace